public enum PlayerState
{
    Nothing = 0, // Просто стоит на земле
    CrouchedToJump = 1, // Зажат пробел, готовится к прыжку
    Jump = 2, // Находится в воздухе во время прыжка от земли или стены
    Rift = 3, // Рывок, вдоль земли. Если вылетел в воздух во время рывка, то должно быть Jump
    HangingOnLeftWall = 4, // После прыжка ударился в левую стену и не касается пола
    HangingOnRightWall = 5, // После прыжка ударился в правую стену и не касается пола
    CrouchedToJumpFromLeftWall = 6, // Зажат пробел, готовится к прыжку от стены
    CrouchedToJumpFromRightWall = 7 // Зажат пробел, готовится к прыжку от стены
}